# Dataframes

In [5]:
from numpy.random import randn
import pandas as pd

In [11]:
df = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [13]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[['W']] # devolvendo a series em formato dataframe

          W
A  1.828372
B -0.532891
C  1.023312
D  0.370217
E -0.079927

In [29]:
df["new"] = df["W"] + df["Y"]
df

          W         X         Y         Z       new
A  1.828372 -1.004173  0.228854  1.965662  2.057226
B -0.532891  0.110008  0.655576  0.618949  0.122685
C  1.023312  1.174057  0.474918 -1.528904  1.498230
D  0.370217 -1.000574 -0.829447 -0.423803 -0.459231
E -0.079927  0.161314 -0.971473  1.079347 -1.051400

In [27]:
df.drop("new", axis=1) # axis = 1 === coluna, axis = 0 === linha

          W         X         Y         Z
A  1.828372 -1.004173  0.228854  1.965662
B -0.532891  0.110008  0.655576  0.618949
C  1.023312  1.174057  0.474918 -1.528904
D  0.370217 -1.000574 -0.829447 -0.423803
E -0.079927  0.161314 -0.971473  1.079347

In [31]:
df.drop("new", axis=1, inplace=True) # Altera o dataframe original

In [33]:
df

          W         X         Y         Z
A  1.828372 -1.004173  0.228854  1.965662
B -0.532891  0.110008  0.655576  0.618949
C  1.023312  1.174057  0.474918 -1.528904
D  0.370217 -1.000574 -0.829447 -0.423803
E -0.079927  0.161314 -0.971473  1.079347

In [37]:
df.loc[['A']] # procurando por a nas linhas

          W         X         Y         Z
A  1.828372 -1.004173  0.228854  1.965662

In [39]:
df.iloc[0, 2]

0.22885399478340052